Repository: EinarSolhaug/reder_info
Catalog: web/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: e.g., @twitter_handle, facebook.com/page
ar: مثال: @twitter_handle، facebook.com/page

source: e.g., document.pdf, image.jpg
ar: مثال: document.pdf، image.jpg

source: Additional notes...
ar: ملاحظات إضافية...

source: Select Ownership
ar: اختر الملكية

source: Select Access Status
ar: اختر حالة الوصول

source: Select Category
ar: الفئة

source: Create Source
ar: إنشاء

source: Create a copy of this source?
ar: إنشاء نسخة من هذا المصدر؟

source: Are you sure you want to delete this source? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذا المصدر؟ لا يمكن التراجع عن هذا الإجراء.

source: Source duplicated successfully!
ar: تم نسخ المصدر بنجاح!

source: Error duplicating source
ar: خطأ في نسخ المصدر

source: Source status updated!
ar: تم تحديث حالة المصدر!

source: Error updating source status
ar: خطأ في تحديث حالة المصدر

source: Source data exported successfully!
ar: تم تصدير بيانات المصدر بنجاح!

source: Error exporting source data
ar: خطأ في تصدير بيانات المصدر

source: Error deleting source
ar: خطأ في حذف المصدر

source: Update Source
ar: تحديث

source: Error loading source
ar: خطأ في تحميل المصدر

source: Error loading source data
ar: خطأ في تحميل بيانات المصدر

source: Please fill in all required fields (Name, Job/Type, Country)
ar: يرجى ملء جميع الحقول المطلوبة (الاسم، الوظيفة/النوع، الدولة)

source: Source updated successfully!
ar: تم تحديث المصدر بنجاح!

source: Source created successfully!
ar: تم إنشاء المصدر بنجاح!

source: Error saving source
ar: خطأ في حفظ المصدر

source: Back to Words
ar: العودة إلى الكلمات

source: Word Information
ar: معلومات الكلمة

source: Word ID
ar: معرف الكلمة

source: Word Text
ar: نص الكلمة

source: Edit Word
ar: تعديل

source: Delete Word
ar: حذف

source: Are you sure you want to delete this word?
ar: هل أنت متأكد أنك تريد حذف هذه الكلمة؟

source: Word deleted successfully!
ar: تم حذف الكلمة المفتاحية بنجاح!

source: Error loading word
ar: خطأ في تحميل الكلمة

source: Words Management
ar: إدارة الكلمات المفتاحية

source: Add Word
ar: إضافة

source: Search Words
ar: البحث

source: Search words...
ar: البحث

source: Sort by word
ar: كلمة

source: Enter a single word. Words must be unique.
ar: أدخل كلمة واحدة. يجب أن تكون الكلمات فريدة.

source: Save Word
ar: حفظ

source: Error loading words
ar: خطأ في تحميل الكلمات

source: No words found matching
ar: لم يتم العثور على كلمات

source: No words yet — add your first word.
ar: لا توجد كلمات بعد — أضف أول كلمة لك.

source: Delete word #
ar: حذف

source: words
ar: كلمات البريد الإلكتروني

source: Error updating word
ar: خطأ في تحديث الكلمة

source: Error deleting words
ar: خطأ في حذف الكلمات

source: Delete selected words?
ar: حذف المحدد

source: Word updated successfully
ar: تم تحديث الكلمة بنجاح

source: Word added successfully
ar: تم إضافة الكلمة بنجاح

source: Word already exists
ar: الكلمة موجودة بالفعل

source: Word is required
ar: الكلمة مطلوبة

source: Email-like Words
ar: كلمات شبيهة بالبريد الإلكتروني

source: Email Addresses
ar: عناوين البريد الإلكتروني

source: Export all
ar: تصدير الكل

source: emails from database
ar: رسائل بريد إلكتروني من قاعدة البيانات

source: Export All
ar: تصدير الكل

source: Copy all
ar: نسخ الكل

source: emails from database to clipboard
ar: رسائل بريد إلكتروني من قاعدة البيانات إلى الحافظة

source: Copy All
ar: نسخ الكل

source: Refresh data
ar: تحديث البيانات

source: Unique Email-like Words
ar: كلمات شبيهة بالبريد الإلكتروني فريدة

source: Words on This Page
ar: الكلمات في هذه الصفحة

source: Current Page
ar: الصفحة الحالية

source: Total Pages
ar: إجمالي الصفحات

source: Email-like Words Found
ar: تم العثور على كلمات شبيهة بالبريد الإلكتروني

source: Search email addresses...
ar: البحث عن عناوين البريد الإلكتروني...

source: Email Address
ar: عنوان البريد الإلكتروني

source: Validation
ar: التحقق

source: Domain
ar: النطاق

source: Valid
ar: صالح

source: Search in Files
ar: البحث في الملفات

source: Add to Contacts
ar: إضافة إلى جهات الاتصال

source: email-like words
ar: كلمات شبيهة بالبريد الإلكتروني

source: Help
ar: مساعدة

source: Page navigation
ar: تنقل الصفحات

source: First
ar: الأول

source: Last
ar: الأخير

source: No Email-like Words Found
ar: لم يتم العثور على كلمات شبيهة بالبريد الإلكتروني

source: No words matching the email pattern (@ and .) were found in the database.
ar: لم يتم العثور على كلمات تطابق نمط البريد الإلكتروني (@ و .) في قاعدة البيانات.

source: Go to Dashboard
ar: الذهاب إلى لوحة التحكم

source: Archives
ar: استخراج الأرشيفات

source: File Management and Analysis
ar: إدارة وتحليل الملفات

source: Comprehensive analysis, classification, and insights
ar: تحليل وتصنيف ورؤى شاملة

source: Advanced Filters
ar: مرشحات متقدمة

source: Close Filters
ar: إغلاق

source: Filter by Category
ar: تصفية حسب الفئة

source: Filter by Source
ar: تصفية حسب المصدر

source: Filter by Side
ar: تصفية

source: Filter from date
ar: تصفية من تاريخ

source: From date
ar: التاريخ

source: Filter to date
ar: تصفية

source: To date
ar: التاريخ

source: Reset Filters
ar: إعادة تعيين

source: Forward
ar: تقدم

source: ID (Ascending)
ar: تصاعدي

source: ID (Descending)
ar: تنازلي

source: Name (Z-A)
ar: الاسم (ي-أ)

source: File Count (High to Low)
ar: عدد الملفات (من الأعلى إلى الأدنى)

source: File Count (Low to High)
ar: عدد الملفات (من الأدنى إلى الأعلى)

source: Switch to Grid View
ar: التبديل إلى عرض الشبكة

source: List View
ar: عرض

source: Switch to List View
ar: التبديل إلى عرض القائمة

source: Titles
ar: العناوين المشابهة

source: Hash
ar: التكرارات المتطابقة

source: Add Side
ar: إضافة

source: Add Category
ar: إضافة

source: Search words from words table...
ar: البحث عن كلمات من جدول الكلمات...

source: Category Name (from Words table)
ar: اسم الفئة (من جدول الكلمات)

source: Type to search for a word...
ar: اكتب للبحث عن كلمة...

source: Type at least 2 characters to search for existing words from the words table. You can also type a completely new word.
ar: اكتب حرفين على الأقل للبحث عن كلمات موجودة من جدول الكلمات. يمكنك أيضاً كتابة كلمة جديدة تماماً.

source: Add Word-Category Relationship
ar: إضافة علاقة كلمة-فئة

source: Select a word from the words table.
ar: اختر كلمة من جدول الكلمات.

source: Select a category from the categories table.
ar: اختر فئة من جدول الفئات.

source: Add Relationship
ar: إضافة علاقة

source: Previous File
ar: السابق

source: Next File
ar: التالي

source: File Details
ar: التفاصيل

source: Close File Details
ar: إغلاق تفاصيل الملف

source: File Content
ar: ملف

source: Copy Content
ar: نسخ

source: Download Content
ar: تحميل

source: Export File
ar: تصدير

source: Search in document...
ar: البحث في المستند...

source: Case Sensitive
ar: بحث حساس لحالة الأحرف

source: Whole Word
ar: كلمة

source: Match 0 of 0
ar: تطابق 0 من 0

source: Loading content...
ar: جارٍ تحميل المحتوى...

source: Classification & Analysis
ar: التصنيف والتحليل

source: Loading analysis...
ar: جارٍ تحميل التحليل...

source: Metadata
ar: عرض البيانات الوصفية

source: Loading metadata...
ar: جارٍ تحميل البيانات الوصفية...

source: Add Source
ar: إضافة

source: Add Word-Category
ar: الفئة

source: Page Navigation
ar: تنقل الصفحات

source: Previous Page
ar: السابق

source: Go to page
ar: صفحة

source: No items found in this section
ar: لم يتم العثور على عناصر في هذا القسم

source: Search displayed files
ar: البحث في الملفات المعروضة

source: Select All Files
ar: تحديد الكل

source: Deselect All Files
ar: تحديد الكل

source: Export Selected Files
ar: تصدير الملفات المحددة

source: Export Selected
ar: تصدير

source: selected
ar: تعديل المحدد

source: No files found
ar: ملفات

source: Next Page
ar: التالي

source: Current page
ar: الحالي

source: Top Categories by File Count
ar: أفضل الفئات حسب عدد الملفات

source: Top Sources Distribution
ar: توزيع أفضل المصادر

source: Data Distribution
ar: توزيع البيانات

source: Hashes
ar: حساب تجزئات الملفات

source: Select file
ar: ملف

source: View Details for
ar: التفاصيل

source: Open Full View in New Tab
ar: فتح العرض الكامل في علامة تبويب جديدة

source: Open Full View in New Tab for
ar: فتح العرض الكامل في علامة تبويب جديدة لـ

source: Full View
ar: عرض

source: Error loading items
ar: خطأ في تحميل العناصر

source: Source name is required
ar: اسم المصدر مطلوب

source: Side name is required
ar: اسم الجانب مطلوب

source: At least one word is required
ar: كلمة واحدة على الأقل مطلوبة

source: Category name is required
ar: اسم الفئة مطلوب

source: Both word and category are required
ar: الكلمة والفئة مطلوبتان

source: Successfully added
ar: تمت الإضافة بنجاح

source: Successfully added word-category relationship
ar: تمت إضافة علاقة كلمة-فئة بنجاح

source: Error adding
ar: إضافة

source: Error adding word-category relationship
ar: خطأ في إضافة علاقة كلمة-فئة

source: Submitting...
ar: إرسال

source: Filters applied! (This will filter all sections)
ar: تم تطبيق المرشحات! (سيتم تصفية جميع الأقسام)

source: (Content truncated for display)
ar: (تم اقتطاع المحتوى للعرض)

source: No content available
ar: لا يوجد محتوى متاح

source: No categories assigned
ar: لا توجد فئات مخصصة

source: Analytics
ar: تحليلات الملفات الشاملة

source: Content
ar: تحليل المحتوى

source: Search in Document
ar: البحث في المستند

source: Search within this document...
ar: البحث داخل هذا المستند...

source: Document Content
ar: محتوى المستند

source: Page size:
ar: الحجم

source: Go to:
ar: انتقل إلى:

source: Go
ar: الذهاب إلى الصفحة الرئيسية

source: View Full Content
ar: عرض المحتوى الكامل

source: Reprocess this file? This may take a moment.
ar: إعادة معالجة هذا الملف؟ قد يستغرق هذا لحظة.

source: Reprocess
ar: إعادة المعالجة

source: This file may not have been processed yet, or the content could not be loaded.
ar: قد لا يكون هذا الملف قد تم معالجته بعد، أو لم يتم تحميل المحتوى.

source: Reprocess this file? This will extract and store the content again.
ar: إعادة معالجة هذا الملف؟ سيتم استخراج وتخزين المحتوى مرة أخرى.

source: Reprocess File
ar: إعادة معالجة الملف

source: File Information
ar: معلومات الملف

source: Type:
ar: النوع

source: Size:
ar: الحجم

source: Created:
ar: إنشاء

source: Status:
ar: الحالة

source: Quick Stats
ar: إحصائيات سريعة

source: Sentences
ar: الجمل

source: Paragraphs
ar: الفقرات

source: Characters
ar: اكتب حرفين على الأقل للبحث عن الكلمات من جدول الكلمات. يجب عليك اختيار كلمتين على الأقل لإنشاء عبارة كلمة مفتاحية.

source: Classification Analysis
ar: تحليل التصنيف

source: Word Frequency
ar: تحليل تكرار الكلمات

source: No frequency data available
ar: لا توجد بيانات تردد متاحة

source: Top Keywords
ar: الكلمات المفتاحية

source: Frequency
ar: تحليل تكرار الكلمات

source: No keywords available
ar: لا توجد كلمات مفتاحية متاحة

source: Document Metadata
ar: البيانات الوصفية للمستند

source: File Date
ar: ملف

source: Add your notes about this document...
ar: أضف ملاحظاتك حول هذا المستند...

source: ID:
ar: المعرف

source: Path:
ar: المسار

source: File Date:
ar: ملف

source: Hash ID:
ar: المعرف

source: Security & Hash
ar: الأمان والتجزئة

source: Hash:
ar: التجزئة:

source: No matches
ar: لا

source: Chart library not loaded
ar: لم يتم تحميل مكتبة الرسوم البيانية

source: Invalid data format
ar: تنسيق بيانات غير صالح

source: No valid frequency data
ar: لا توجد بيانات تردد صالحة

source: Metadata saved successfully!
ar: تم حفظ البيانات الوصفية بنجاح!

source: Share link copied to clipboard!
ar: تم نسخ رابط المشاركة إلى الحافظة!

source: Selected
ar: تعديل المحدد

source: Search by name, content...
ar: البحث بالاسم، المحتوى...

source: Largest First
ar: الأول

source: Smallest First
ar: الأول

source: Analyze
ar: يرجى اختيار الملفات للتحليل

source: View:
ar: عرض

source: Showing records
ar: عرض

source: No files found.
ar: لم يتم العثور على ملفات.

source: Upload your first file
ar: ارفع أول ملف لك

source: No records
ar: لا

source: Reader
ar: القارئ

source: Toolbar
ar: شريط الأدوات

source: Print
ar: طباعة

source: Wrap
ar: التفاف

source: Smaller
ar: الكل

source: Larger
ar: أكبر

source: Bytes Stored
ar: البايتات المخزنة

source: Chunks
ar: القطع

source: Search... (supports whole word, case)
ar: بحث... (يدعم الكلمة الكاملة، حالة الأحرف)

source: Aa
ar: أأ

source: Whole
ar: كامل

source: Loading…
ar: جارٍ التحميل…

source: Ready
ar: جاهز

source: Chunk size
ar: الحجم

source: CLI File Processor
ar: معالج ملفات CLI

source: Command-line interface for processing files
ar: واجهة سطر الأوامر لمعالجة الملفات

source: File Processor CLI
ar: معالج ملفات CLI

source: IDLE
ar: المعرف

source: Enter File Path or Select File/Folder
ar: أدخل مسار الملف أو اختر ملف/مجلد

source: C:/Users/Documents/file.pdf or /home/user/file.pdf
ar: C:/Users/Documents/file.pdf أو /home/user/file.pdf

source: Browse
ar: تحقق من وحدة تحكم المتصفح للتفاصيل

source: Enter full path to file or directory, or click Browse to select
ar: أدخل المسار الكامل للملف أو المجلد، أو انقر على تصفح للاختيار

source: Select Source
ar: المصدر

source: -- Select Source --
ar: -- اختر المصدر --

source: Select Side
ar: المعرف

source: -- Select Side --
ar: -- اختر الجانب --

source: Run Process
ar: تشغيل العملية

source: Clear Log
ar: مسح السجل

source: Welcome to File Processor CLI
ar: مرحباً بك في معالج ملفات CLI

source: Enter file path, select source and side, then click "Run Process"
ar: أدخل مسار الملف، اختر المصدر والجانب، ثم انقر على "تشغيل العملية"

source: Instructions
ar: التعليمات

source: Select a source from the dropdown
ar: اختر مصدراً من القائمة المنسدلة

source: Select a side from the dropdown
ar: اختر جانباً من القائمة المنسدلة

source: Click "Run Process" to start
ar: انقر على "تشغيل العملية" للبدء

source: Monitor progress in the log window
ar: راقب التقدم في نافذة السجل

source: Tips
ar: نصائح

source: Supports files and directories
ar: يدعم الملفات والمجلدات

source: Real-time processing logs
ar: سجلات المعالجة في الوقت الفعلي

source: Automatic duplicate detection
ar: اكتشاف التكرارات التلقائي

source: Cannot change file selection while processing
ar: لا يمكن تغيير اختيار الملف أثناء المعالجة

source: Select File(s)
ar: اختيار ملف(ملفات)

source: Full Path
ar: المسار الكامل

source: Select Folder
ar: اختيار مجلد

source: File System Access API selected, but path not directly available.
ar: تم اختيار واجهة برمجة تطبيقات الوصول إلى نظام الملفات، لكن المسار غير متاح مباشرة.

source: Falling back to regular file input...
ar: الرجوع إلى إدخال الملف العادي...

source: Full path selected:
ar: تم اختيار المسار الكامل:

source: Selected {count} files from:
ar: تم اختيار {count} ملفات من:

source: Full folder path selected:
ar: تم اختيار مسار المجلد الكامل:

source: Selected folder:
ar: المجلد المحدد:

source: Could not extract full path. Please enter the full absolute path manually.
ar: تعذر استخراج المسار الكامل. يرجى إدخال المسار المطلق الكامل يدوياً.

source: Example:
ar: مثال:

source: Selected file:
ar: الملف المحدد:

source: Full path extracted:
ar: تم استخراج المسار الكامل:

source: File selected:
ar: تم اختيار الملف:

source: Full absolute path could not be extracted due to browser security restrictions.
ar: تعذر استخراج المسار المطلق الكامل بسبب قيود أمان المتصفح.

source: Please enter the complete absolute path manually in the input field above.
ar: يرجى إدخال المسار المطلق الكامل يدوياً في حقل الإدخال أعلاه.

source: Example paths:
ar: أمثلة على المسارات:

source: Enter full path (e.g., C:\Users\...\{filename})
ar: أدخل المسار الكامل (مثل: C:\Users\...\{filename})

source: Selected {count} files
ar: تم اختيار {count} ملفات

source: Could not determine common directory path. Please enter the full directory path manually.
ar: تعذر تحديد مسار المجلد المشترك. يرجى إدخال مسار المجلد الكامل يدوياً.

source: Selected folder with {count} files
ar: تم اختيار مجلد يحتوي على {count} ملفات

source: Checking files for path information...
ar: جاري التحقق من الملفات للحصول على معلومات المسار...

source: Folder name detected:
ar: تم اكتشاف اسم المجلد:

source: Could not extract any folder path information.
ar: تعذر استخراج أي معلومات عن مسار المجلد.

source: Please enter the full absolute path manually.
ar: تعذر استخراج المسار الكامل. يرجى إدخال المسار المطلق الكامل يدوياً.

source: Example: C:\Users\Documents\MyFolder or /home/user/documents/MyFolder
ar: مثال: C:\Users\Documents\MyFolder أو /home/user/documents/MyFolder

source: Processing:
ar: المعالجة

source: Processing: {current} of {total} files
ar: المعالجة: {current} من {total} ملف

source: Processing: {current} files...
ar: المعالجة: {current} ملف...

source: Starting...
ar: جارٍ البدء...

source: Process already running. Please wait...
ar: العملية قيد التشغيل بالفعل. يرجى الانتظار...

source: Please enter a file path
ar: يرجى إدخال مسار ملف

source: Please select both Source and Side
ar: يرجى اختيار المصدر والجانب معاً

source: PROCESSING
ar: جاري المعالجة...

source: Source ID:
ar: المصدر

source: Side ID:
ar: المعرف

source: Processing failed
ar: المعالجة

source: Scanning directory...
ar: جارٍ مسح المجلد...

source: Processing file...
ar: المعالجة

source: Completed processing
ar: اكتملت المعالجة

source: Process completed successfully!
ar: اكتملت العملية بنجاح!

source: SUCCESS
ar: نجح

source: Completed successfully
ar: اكتمل بنجاح

source: Unknown error occurred
ar: خطأ غير معروف

source: Network error: Connection interrupted. This may be due to a server timeout or database connection issue. Check server logs for details.
ar: خطأ في الشبكة: تم قطع الاتصال. قد يكون هذا بسبب انتهاء مهلة الخادم أو مشكلة في اتصال قاعدة البيانات. تحقق من سجلات الخادم للتفاصيل.

source: Request was cancelled
ar: تم إلغاء الطلب

source: Error:
ar: خطأ

source: ERROR
ar: 500 - خطأ في الخادم الداخلي

source: Cannot clear log while processing
ar: لا يمكن مسح السجل أثناء المعالجة

source: Log cleared
ar: تم مسح السجل

source: Language changed to %(lang)s
ar: تم تغيير اللغة إلى %(lang)s
