Repository: EinarSolhaug/reder_info
Catalog: web/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: Settings Valid
ar: الإعدادات صالحة

source: Note: Use Settings page to apply imported settings
ar: ملاحظة: استخدم صفحة الإعدادات لتطبيق الإعدادات المستوردة

source: Invalid settings file
ar: ملف إعدادات غير صالح

source: Keyword Details
ar: التفاصيل

source: Back to Keywords
ar: الكلمات المفتاحية

source: Keyword Information
ar: معلومات الكلمة المفتاحية

source: Keyword ID
ar: الكلمة المفتاحية

source: Usage Count
ar: عدد الاستخدامات

source: Keyword Text
ar: الكلمة المفتاحية

source: Last Used
ar: الأخير

source: Actions
ar: الإجراءات

source: Edit Keyword
ar: تعديل

source: Delete Keyword
ar: حذف كلمة مفتاحية

source: Are you sure you want to delete this keyword?
ar: هل أنت متأكد أنك تريد حذف هذه الكلمة المفتاحية؟

source: Keyword deleted successfully!
ar: تم حذف الكلمة المفتاحية بنجاح!

source: Keywords Management
ar: إدارة الكلمات المفتاحية

source: Total Keywords
ar: إجمالي الكلمات المفتاحية

source: Active
ar: نشط

source: Duplicates
ar: التكرارات

source: Search Keywords
ar: البحث عن الكلمات المفتاحية

source: Search keywords...
ar: البحث عن الكلمات المفتاحية...

source: Clear search
ar: مسح البحث

source: All Status
ar: جميع الحالات

source: Unused
ar: غير مستخدم

source: Sort By
ar: ترتيب حسب

source: ID
ar: المعرف

source: Date Created
ar: تاريخ الإنشاء

source: Order
ar: الترتيب

source: Descending
ar: تنازلي

source: Ascending
ar: تصاعدي

source: Selection:
ar: التحديد:

source: Bulk Actions:
ar: إجراءات مجمعة:

source: Edit Selected
ar: تعديل المحدد

source: Delete Selected
ar: حذف المحدد

source: Actions:
ar: الإجراءات:

source: Merge all duplicate keywords
ar: دمج جميع الكلمات المفتاحية المكررة

source: Merge Duplicates
ar: دمج التكرارات

source: Per Page:
ar: لكل صفحة:

source: Sort by text
ar: ترتيب حسب النص

source: Usage
ar: الاستخدام

source: Sort by usage
ar: ترتيب حسب الاستخدام

source: Sort by status
ar: ترتيب حسب الحالة

source: Add Keyword
ar: إضافة كلمة مفتاحية

source: Words (from Words table)
ar: الكلمات (من جدول الكلمات)

source: Type to search and select words...
ar: اكتب للبحث واختيار الكلمات...

source: Type at least 2 characters to search for words from the words table. You must select at least 2 words to create a keyword phrase.
ar: اكتب حرفين على الأقل للبحث عن الكلمات من جدول الكلمات. يجب عليك اختيار كلمتين على الأقل لإنشاء عبارة كلمة مفتاحية.

source: Category (from Categories table)
ar: الفئة (من جدول الفئات)

source: Type to search for a category...
ar: اكتب للبحث عن فئة...

source: Type to search for categories from the categories table.
ar: اكتب للبحث عن الفئات من جدول الفئات.

source: Edit inline
ar: تعديل مباشر

source: View Details
ar: عرض التفاصيل

source: Merge duplicates
ar: التكرارات

source: Check browser console for details
ar: تحقق من وحدة تحكم المتصفح للتفاصيل

source: Failed to load keywords
ar: فشل تحميل الكلمات المفتاحية

source: Check browser console and server logs for details
ar: تحقق من وحدة تحكم المتصفح وسجلات الخادم للتفاصيل

source: No keywords found matching
ar: لم يتم العثور على كلمات مفتاحية مطابقة

source: No keywords yet — add your first keyword.
ar: لا توجد كلمات مفتاحية بعد — أضف كلمتك المفتاحية الأولى.

source: Duplicate
ar: مكرر

source: Delete keyword #
ar: حذف كلمة مفتاحية #

source: Failed to delete
ar: فشل الحذف

source: Merge all duplicates of
ar: دمج جميع التكرارات لـ

source: Successfully merged
ar: تم الدمج بنجاح

source: duplicate keywords for
ar: كلمات مفتاحية مكررة لـ

source: Total usage
ar: إجمالي الاستخدام

source: Error merging duplicates
ar: خطأ في دمج التكرارات

source: Try a different search term.
ar: جرب مصطلح بحث مختلف.

source: add your first keyword
ar: أضف كلمتك المفتاحية الأولى

source: Showing
ar: عرض

source: Page
ar: صفحة

source: of
ar: من

source: Error updating keyword
ar: خطأ في تحديث الكلمة المفتاحية

source: Error deleting keywords
ar: خطأ في حذف الكلمات المفتاحية

source: Error updating keywords
ar: خطأ في تحديث الكلمات المفتاحية

source: Delete selected keywords?
ar: حذف الكلمات المفتاحية المحددة؟

source: Successfully deleted
ar: تم الحذف بنجاح

source: Successfully updated
ar: تم التحديث بنجاح

source: Merge ALL duplicate keywords in the database?
ar: دمج جميع الكلمات المفتاحية المكررة في قاعدة البيانات؟

source: This will: - Find all keywords with the same text - Keep the first occurrence (lowest ID) - Transfer all usage statistics to the first - Delete duplicates This may take a few moments...
ar: سيؤدي هذا إلى: - العثور على جميع الكلمات المفتاحية بنفس النص - الاحتفاظ بالتكرار الأول (أقل معرف) - نقل جميع إحصائيات الاستخدام إلى الأول - حذف التكرارات قد يستغرق هذا بضع لحظات...

source: Merging...
ar: جاري الدمج...

source: Successfully merged all duplicates!
ar: تم دمج جميع التكرارات بنجاح!

source: Merged
ar: مدمج

source: Duplicate sets
ar: مجموعات التكرارات

source: Refreshing page...
ar: جاري تحديث الصفحة...

source: System alerts and notifications
ar: تنبيهات وإشعارات النظام

source: Mark All Read
ar: تعليم الكل كمقروء

source: All Notifications
ar: جميع الإشعارات

source: Duplicate Files
ar: ملفات مكررة

source: Future Files
ar: ملفات مستقبلية

source: Search notifications...
ar: البحث عن الإشعارات...

source: Sort by
ar: ترتيب حسب

source: Newest First
ar: الأحدث أولاً

source: Oldest First
ar: الأقدم أولاً

source: Priority: High to Low
ar: الأولوية: من الأعلى إلى الأدنى

source: Priority: Low to High
ar: الأولوية: من الأدنى إلى الأعلى

source: Title: A-Z
ar: العنوان: أ-ي

source: Title: Z-A
ar: العنوان: ي-أ

source: All
ar: الكل

source: Destination
ar: الوجهة

source: Search duplicate files...
ar: البحث عن الملفات المكررة...

source: Search future files...
ar: البحث عن الملفات المستقبلية...

source: Notification Details
ar: تفاصيل الإشعار

source: Mark as Read
ar: تعليم كمقروء

source: Dismiss
ar: رفض

source: No Notifications
ar: الإشعارات

source: No notifications found matching your criteria.
ar: لم يتم العثور على إشعارات تطابق معاييرك.

source: to
ar: حدث خطأ من جانبنا. نحن نعمل على إصلاحه.

source: notifications
ar: الإشعارات

source: Just now
ar: لا

source: m ago
ar: منذ د

source: h ago
ar: منذ س

source: d ago
ar: منذ ي

source: Mark all notifications as read?
ar: تحديد جميع الإشعارات كمقروءة؟

source: Dismiss this notification?
ar: إلغاء هذا الإشعار؟

source: Message
ar: الرسالة

source: Created
ar: إنشاء

source: Event Date
ar: التاريخ

source: File Path
ar: ملف

source: Additional Information
ar: معلومات إضافية

source: Saved Searches
ar: البحث

source: New Search
ar: البحث

source: Search saved searches...
ar: البحث في عمليات البحث المحفوظة...

source: Alert
ar: تنبيهات وإشعارات النظام

source: Last Run:
ar: الأخير

source: Results:
ar: نتائج

source: documents
ar: استخراج محتوى النص من المستندات للبحث والتحليل

source: Run
ar: تشغيل الآن

source: No Saved Searches
ar: لا توجد عمليات بحث محفوظة

source: Create your first saved search to quickly access common queries
ar: أنشئ أول عملية بحث محفوظة للوصول السريع إلى الاستعلامات الشائعة

source: Create Saved Search
ar: إنشاء بحث محفوظ

source: Configure Alert
ar: تكوين التنبيه

source: Alert Frequency
ar: تكرار التنبيه

source: Real-time (when new matches found)
ar: في الوقت الفعلي (عند العثور على تطابقات جديدة)

source: Hourly
ar: كل ساعة

source: Daily
ar: يومي

source: Weekly
ar: أسبوع

source: Monthly
ar: شهر

source: Notification Method
ar: طريقة الإشعار

source: Email Notification
ar: إشعار بالبريد الإلكتروني

source: In-App Notification
ar: إشعار داخل التطبيق

source: Minimum New Documents
ar: الحد الأدنى للمستندات الجديدة

source: Only send alert if at least this many new documents match
ar: إرسال التنبيه فقط إذا تطابق هذا العدد على الأقل من المستندات الجديدة

source: Alert Active
ar: نشط

source: Save Alert
ar: حفظ

source: Error running search
ar: خطأ في تشغيل البحث

source: Alert configuration saved!
ar: تم حفظ تكوين التنبيه!

source: Are you sure you want to delete this saved search?
ar: هل أنت متأكد أنك تريد حذف عملية البحث المحفوظة هذه؟

source: Search deleted successfully
ar: تم حذف البحث بنجاح

source: Search Files
ar: البحث

source: Advanced Search
ar: بحث متقدم

source: Enhanced Search
ar: بحث محسّن

source: Search files...
ar: البحث

source: found
ar: 404 - الصفحة غير موجودة

source: Source:
ar: المصدر

source: Side:
ar: المعرف

source: Date:
ar: التاريخ

source: Search pagination
ar: ترقيم صفحات البحث

source: No results found for
ar: لم يتم العثور على نتائج

source: Search Criteria
ar: البحث

source: Search in Content
ar: البحث في المحتوى

source: Keywords...
ar: الكلمات المفتاحية

source: Case
ar: بحث حساس لحالة الأحرف

source: Whole word
ar: كلمة

source: File name...
ar: اسم الملف

source: Date Range
ar: التاريخ

source: From
ar: الكلمات (من جدول الكلمات)

source: To
ar: حدث خطأ من جانبنا. نحن نعمل على إصلاحه.

source: Word Document
ar: كلمة

source: Analyzed
ar: الملفات المحللة

source: Pending
ar: معلق

source: Scanning:
ar: جارٍ المسح:

source: Results
ar: لم يتم العثور على نتائج

source: Sort: Relevance
ar: الترتيب: الصلة

source: Date (Newest)
ar: التاريخ

source: Date (Oldest)
ar: التاريخ

source: Name (A-Z)
ar: الاسم (أ-ي)

source: Size (Largest)
ar: الحجم (الأكبر)

source: No results found matching your criteria
ar: لم يتم العثور على نتائج تطابق معاييرك

source: Full-text search with advanced filters, sorting, and export
ar: بحث نصي كامل مع مرشحات متقدمة وفرز وتصدير

source: Search Query
ar: استعلام البحث

source: Enter search terms...
ar: أدخل مصطلحات البحث...

source: Relevance
ar: الصلة

source: Date
ar: التاريخ

source: Name
ar: الاسم

source: Date From
ar: من تاريخ

source: Date To
ar: إلى تاريخ

source: Recent Searches
ar: عمليات البحث الأخيرة

source: Enter a search query to get started
ar: أدخل استعلام بحث للبدء

source: File Preview
ar: معاينة الملف

source: Clear all search history?
ar: مسح جميع سجل البحث؟

source: No search history
ar: لا يوجد سجل بحث

source: Error clearing history
ar: خطأ في مسح السجل

source: Configure and customize your system preferences
ar: تكوين وتخصيص تفضيلات النظام

source: Back to Dashboard
ar: العودة إلى لوحة التحكم

source: General
ar: عام

source: Display
ar: العرض

source: Interfaces
ar: واجهات

source: System
ar: النظام

source: User Preferences
ar: تفضيلات المستخدم

source: Select your preferred language for the interface
ar: اختر لغتك المفضلة للواجهة

source: Timezone
ar: المنطقة الزمنية

source: Set your timezone for date and time display
ar: تعيين منطقتك الزمنية لعرض التاريخ والوقت

source: Date Format
ar: تنسيق التاريخ

source: Choose how dates are displayed throughout the system
ar: اختر كيفية عرض التواريخ في جميع أنحاء النظام

source: Time Format
ar: تنسيق الوقت

source: Select 12-hour or 24-hour time format
ar: اختر تنسيق الوقت 12 ساعة أو 24 ساعة

source: Behavior & Actions
ar: السلوك والإجراءات

source: Auto Save
ar: حفظ تلقائي

source: Automatically save changes without confirmation dialogs
ar: حفظ التغييرات تلقائياً دون مربعات حوار التأكيد

source: Confirm Actions
ar: تأكيد الإجراءات

source: Show confirmation dialogs for important or destructive actions
ar: عرض مربعات حوار التأكيد للإجراءات المهمة أو المدمرة

source: Visual Preferences
ar: تفضيلات العرض

source: Animations
ar: الرسوم المتحركة

source: Enable smooth animations and transitions throughout the interface
ar: تمكين الرسوم المتحركة والانتقالات السلسة في جميع أنحاء الواجهة

source: Breadcrumbs
ar: مسار التنقل

source: Show breadcrumb navigation at the top of pages
ar: عرض تنقل مسار التنقل في أعلى الصفحات

source: Compact Mode
ar: وضع المدمج

source: Use compact layout with reduced spacing for more content on screen
ar: استخدام تخطيط مدمج مع تباعد مخفض لمزيد من المحتوى على الشاشة

source: Compact View
ar: عرض مدمج

source: Use compact view for file lists and tables
ar: استخدام عرض مدمج لقوائم وجداول الملفات

source: Theme
ar: المظهر

source: Select the application theme
ar: اختر مظهر التطبيق

source: Light
ar: فاتح

source: Dark
ar: داكن

source: Auto
ar: تلقائي

source: System Preference
ar: تفضيل النظام

source: Items Per Page
ar: العناصر لكل صفحة

source: Number of items to display per page in lists and tables (System-wide)
ar: عدد العناصر المعروضة لكل صفحة في القوائم والجداول (على مستوى النظام)

source: Display Results Per Page
ar: عرض النتائج لكل صفحة

source: Number of results per page for search and file lists (Display-specific)
ar: عدد النتائج لكل صفحة للبحث وقوائم الملفات (خاص بالعرض)

source: Default Sort
ar: الترتيب الافتراضي

source: Default sorting method for file lists
ar: طريقة الترتيب الافتراضية لقوائم الملفات

source: Creation Date
ar: تاريخ الإنشاء

source: File Size
ar: حجم الملف

source: Sort Direction
ar: اتجاه الترتيب

source: Default sort order (ascending or descending)
ar: ترتيب الترتيب الافتراضي (تصاعدي أو تنازلي)

source: Newest first
ar: الأحدث أولاً

source: Oldest first
ar: الأقدم أولاً

source: Show File Preview
ar: عرض معاينة الملف

source: Display file previews in file lists
ar: عرض معاينات الملفات في قوائم الملفات

source: Show Metadata
ar: عرض البيانات الوصفية

source: Display file metadata in file lists
ar: عرض البيانات الوصفية للملفات في قوائم الملفات

source: Search Preferences
ar: تفضيلات البحث

source: Default Search Type
ar: نوع البحث الافتراضي

source: Default search interface to use
ar: واجهة البحث الافتراضية للاستخدام

source: Basic Search
ar: بحث أساسي

source: Case Sensitive Search
ar: بحث حساس لحالة الأحرف

source: Make search queries case-sensitive by default
ar: جعل استعلامات البحث حساسة لحالة الأحرف افتراضياً

source: Highlight Results
ar: تمييز النتائج

source: Highlight matching terms in search results
ar: تمييز المصطلحات المطابقة في نتائج البحث

source: Include file content in search by default
ar: تضمين محتوى الملف في البحث افتراضياً

source: Search in Filename
ar: البحث في اسم الملف

source: Include file names in search by default
ar: تضمين أسماء الملفات في البحث افتراضياً

source: Search in Metadata
ar: البحث في البيانات الوصفية

source: Include file metadata in search by default
ar: تضمين البيانات الوصفية للملفات في البحث افتراضياً

source: Maximum Results
ar: الحد الأقصى للنتائج

source: Maximum number of search results to return
ar: الحد الأقصى لعدد نتائج البحث المراد إرجاعها

source: File Processing
ar: معالجة الملفات

source: Auto Process Uploads
ar: معالجة تلقائية للرفوعات

source: Automatically process files immediately after upload
ar: معالجة الملفات تلقائياً فور الرفع

source: Extract Archives
ar: استخراج الأرشيفات

source: Automatically extract files from archives (ZIP, RAR, etc.)
ar: استخراج الملفات تلقائياً من الأرشيفات (ZIP، RAR، إلخ)

source: Extract Email Attachments
ar: استخراج مرفقات البريد الإلكتروني

source: Automatically extract attachments from email files
ar: استخراج المرفقات تلقائياً من ملفات البريد الإلكتروني

source: Process Nested Files
ar: معالجة الملفات المتداخلة

source: Process files found inside extracted archives and attachments
ar: معالجة الملفات الموجودة داخل الأرشيفات والمرفقات المستخرجة

source: Calculate File Hashes
ar: حساب تجزئات الملفات

source: Calculate and store file hash values (MD5, SHA256) for duplicate detection
ar: حساب وتخزين قيم تجزئة الملفات (MD5، SHA256) لاكتشاف التكرارات

source: Extract Text
ar: استخراج النص

source: Extract text content from documents for search and analysis
ar: استخراج محتوى النص من المستندات للبحث والتحليل

source: Extract Metadata
ar: استخراج البيانات الوصفية

source: Extract file metadata (author, creation date, etc.) from documents
ar: استخراج البيانات الوصفية للملفات (المؤلف، تاريخ الإنشاء، إلخ) من المستندات

source: Interface Visibility
ar: رؤية الواجهة

source: Enable or disable interfaces to customize your navigation menu. All interfaces remain visible but disabled ones are marked.
ar: تمكين أو تعطيل الواجهات لتخصيص قائمة التنقل. تبقى جميع الواجهات مرئية ولكن الواجهات المعطلة محددة.

source: This interface cannot be disabled
ar: لا يمكن تعطيل هذه الواجهة

source: Reset to Defaults
ar: إعادة تعيين إلى الافتراضي

source: Save Changes
ar: حفظ

source: Notification Preferences
ar: تفضيلات الإشعارات

source: Enable Notifications
ar: الإشعارات

source: Show system notifications and alerts
ar: عرض إشعارات وتنبيهات النظام

source: Email Notifications
ar: الإشعارات

source: Send email notifications for important events
ar: إرسال إشعارات بالبريد الإلكتروني للأحداث المهمة

source: Processing Complete
ar: المعالجة

source: Notify when file processing is complete
ar: الإشعار عند اكتمال معالجة الملف

source: Batch Complete
ar: مجموعة

source: Notify when batch processing operations complete
ar: الإشعار عند اكتمال عمليات المعالجة المجمعة

source: Errors Only
ar: خطأ

source: Only show notifications for errors and warnings
ar: عرض الإشعارات للأخطاء والتحذيرات فقط

source: Future Events & Alerts
ar: الأحداث والتنبيهات المستقبلية

source: Similar Files Notifications
ar: إشعارات الملفات المشابهة

source: Notify when similar files are detected
ar: الإشعار عند اكتشاف ملفات مشابهة

source: Future Dates Detection
ar: اكتشاف التواريخ المستقبلية

source: Detect and alert on future dates found in files
ar: اكتشاف والتنبيه على التواريخ المستقبلية الموجودة في الملفات

source: Future Events Detection
ar: اكتشاف الأحداث المستقبلية

source: Analyze verb tenses to detect future-focused content
ar: تحليل أزمنة الأفعال لاكتشاف المحتوى المركّز على المستقبل

source: Auto-Analyze Files
ar: تحليل الملفات تلقائياً

source: Automatically analyze files for future events during processing
ar: تحليل الملفات تلقائياً للأحداث المستقبلية أثناء المعالجة

source: Upcoming Events Window
ar: نافذة الأحداث القادمة

source: Number of days ahead to show upcoming events
ar: عدد الأيام المستقبلية لعرض الأحداث القادمة

source: System Information
ar: معلومات النظام

source: Application Version
ar: إصدار التطبيق

source: Modernized
ar: محدث

source: Database
ar: دمج جميع الكلمات المفتاحية المكررة في قاعدة البيانات؟

source: Production Ready
ar: جاهز للإنتاج

source: Processing Engine
ar: المعالجة

source: Modern
ar: حديث

source: File Processor
ar: معالج الملفات

source: Performance Monitoring
ar: مراقبة الأداء

source: Enabled
ar: مفعّل

source: Real-time
ar: الوقت

source: System Configuration
ar: تكوين النظام

source: Configuration is managed via environment variables. Changes require application restart.
ar: يتم إدارة التكوين عبر متغيرات البيئة. التغييرات تتطلب إعادة تشغيل التطبيق.

source: Processing Settings
ar: المعالجة

source: Max Workers
ar: الحد الأقصى للعمال

source: Chunk Size
ar: الحجم

source: Max Depth
ar: الحد الأقصى للعمق

source: Feature Flags
ar: علامات الميزات

source: Parallel Processing
ar: المعالجة

source: Archive Extraction
ar: استخراج الأرشيف

source: Email Attachments
ar: استخراج مرفقات البريد الإلكتروني

source: Hash Calculation
ar: حساب التجزئة

source: Cache Management
ar: إدارة الذاكرة المؤقتة

source: Manage search result caching for improved performance.
ar: إدارة تخزين نتائج البحث المؤقت لتحسين الأداء.

source: Clear Cache
ar: مسح الذاكرة المؤقتة

source: View Statistics
ar: عرض الإحصائيات

source: API Endpoints
ar: نقاط نهاية API

source: Endpoint
ar: نقطة النهاية

source: Method
ar: طريقة الترتيب الافتراضية لقوائم الملفات

source: Description
ar: الوصف

source: Current performance metrics
ar: مقاييس الأداء الحالية

source: Performance summary report
ar: تقرير ملخص الأداء

source: Clear search cache
ar: مسح البحث

source: Cache statistics
ar: إحصائيات الذاكرة المؤقتة

source: Are you sure you want to clear the search cache?
ar: هل أنت متأكد أنك تريد مسح ذاكرة البحث المؤقتة؟

source: Cache cleared successfully
ar: تم مسح الذاكرة المؤقتة بنجاح

source: Error clearing cache
ar: خطأ في مسح الذاكرة المؤقتة

source: Interface visibility updated successfully
ar: تم تحديث وضوح الواجهة بنجاح

source: Error updating interface visibility
ar: خطأ في تحديث وضوح الواجهة

source: Are you sure you want to reset all interface settings to defaults?
ar: هل أنت متأكد أنك تريد إعادة تعيين جميع إعدادات الواجهة إلى الافتراضي؟

source: Interface settings reset successfully
ar: تم إعادة تعيين إعدادات الواجهة بنجاح

source: Error resetting interface settings
ar: خطأ في إعادة تعيين إعدادات الواجهة

source: All changes saved successfully
ar: تم حفظ جميع التغييرات بنجاح

source: Please reload the page to see changes
ar: يرجى إعادة تحميل الصفحة لرؤية التغييرات

source: Reload now?
ar: لا

source: Setting updated successfully and applied system-wide
ar: تم تحديث الإعداد بنجاح وتطبيقه على مستوى النظام

source: This setting requires a page reload to take effect. Reload now?
ar: يتطلب هذا الإعداد إعادة تحميل الصفحة ليكون ساري المفعول. إعادة التحميل الآن؟

source: Error updating setting
ar: خطأ في تحديث الإعداد

source: Language changed. Reload page to apply system-wide?
ar: تم تغيير اللغة. إعادة تحميل الصفحة لتطبيقها على مستوى النظام؟

source: Cache Statistics
ar: إحصائيات الذاكرة المؤقتة

source: entries
ar: إدخالات

source: seconds
ar: ثواني

source: Average Age
ar: متوسط العمر

source: Hit Rate
ar: معدل الضربات

source: Last updated
ar: تحديث

source: Error loading cache stats
ar: خطأ في تحميل إحصائيات الذاكرة المؤقتة

source: Side Details
ar: التفاصيل

source: Back to Sides
ar: الجوانب

source: Side Information
ar: معلومات الجانب

source: Documents
ar: استخراج محتوى النص من المستندات للبحث والتحليل

source: GB
ar: جيجابايت

source: MB
ar: التخزين (ميجابايت)

source: Edit Side
ar: تعديل

source: Delete Side
ar: حذف

source: Are you sure you want to delete this side?
ar: هل أنت متأكد أنك تريد حذف هذا الجانب؟

source: Side deleted successfully!
ar: تم حذف الجانب بنجاح!

source: Sides Management
ar: إدارة الجوانب

source: Search sides...
ar: البحث

source: Duplicate Side
ar: مكرر

source: Toggle Status
ar: الحالة

source: No sides yet.
ar: الجوانب

source: Add your first side
ar: أضف أول جانب لك

source: Add New Side
ar: إضافة

source: e.g., Government, Opposition Party
ar: مثال: الحكومة، حزب المعارضة

source: Create Side
ar: إنشاء

source: Create a copy of this side?
ar: إنشاء نسخة من هذا الجانب؟

source: Are you sure you want to delete this side? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذا الجانب؟ لا يمكن التراجع عن هذا الإجراء.

source: Side duplicated successfully!
ar: تم نسخ الجانب بنجاح!

source: Error duplicating side
ar: خطأ في نسخ الجانب

source: Side status updated!
ar: تم تحديث حالة الجانب!

source: Error updating status
ar: خطأ في تحديث الحالة

source: Error updating side status
ar: خطأ في تحديث حالة الجانب

source: Error deleting side
ar: خطأ في حذف الجانب

source: Update Side
ar: تحديث

source: Error loading side
ar: خطأ في تحميل الجانب

source: Error loading side data
ar: خطأ في تحميل بيانات الجانب

source: Please fill in the side name
ar: يرجى ملء اسم الجانب

source: Side updated successfully!
ar: تم تحديث الجانب بنجاح!

source: Side created successfully!
ar: تم إنشاء الجانب بنجاح!

source: Error saving side
ar: خطأ في حفظ الجانب

source: Source Details
ar: التفاصيل

source: Source Information
ar: معلومات المصدر

source: Job/Type
ar: النوع

source: Country
ar: الدولة

source: City
ar: المدينة

source: Social Media Accounts
ar: حسابات وسائل التواصل الاجتماعي

source: Attachments
ar: استخراج مرفقات البريد الإلكتروني

source: Notes
ar: لا

source: Ownership
ar: الملكية

source: Access Status
ar: الحالة

source: Date of Source Discovery
ar: تاريخ اكتشاف المصدر

source: Edit Source
ar: تعديل

source: Delete Source
ar: حذف

source: Are you sure you want to delete this source?
ar: هل أنت متأكد أنك تريد حذف هذا المصدر؟

source: Source deleted successfully!
ar: تم حذف المصدر بنجاح!

source: Sources Management
ar: إدارة المصادر

source: Search sources...
ar: البحث في المصادر...

source: Location
ar: الموقع

source: Discovery Date
ar: تاريخ الاكتشاف

source: Duplicate Source
ar: مكرر

source: Export Data
ar: تصدير

source: No sources yet.
ar: المصادر

source: Add your first source
ar: أضف أول مصدر لك

source: Add New Source
ar: المصدر

source: e.g., International News Agency
ar: مثال: وكالة أنباء دولية

source: e.g., International News Job
ar: مثال: وظيفة أخبار دولية

source: e.g., Washington DC
ar: مثال: واشنطن العاصمة

source: Brief description of the source...
ar: وصف موجز للمصدر...
