Repository: EinarSolhaug/reder_info
Catalog: web/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: 404 - Page Not Found
ar: 404 - الصفحة غير موجودة

source: Page Not Found
ar: الصفحة غير موجودة

source: The page you're looking for doesn't exist or has been moved.
ar: الصفحة التي تبحث عنها غير موجودة أو تم نقلها.

source: Go Home
ar: الذهاب إلى الصفحة الرئيسية

source: Go Back
ar: رجوع

source: 500 - Internal Server Error
ar: 500 - خطأ في الخادم الداخلي

source: Internal Server Error
ar: خطأ في الخادم الداخلي

source: Something went wrong on our end. We're working to fix it.
ar: حدث خطأ من جانبنا. نحن نعمل على إصلاحه.

source: What you can do:
ar: ما يمكنك فعله:

source: Try refreshing the page
ar: حاول تحديث الصفحة

source: Check back in a few minutes
ar: تحقق مرة أخرى بعد بضع دقائق

source: Contact support if the problem persists
ar: اتصل بالدعم إذا استمرت المشكلة

source: Retry
ar: إعادة المحاولة

source: File Analysis System
ar: نظام تحليل الملفات

source: File Analysis
ar: تحليل الملفات

source: Dashboard
ar: لوحة التحكم

source: Analysis
ar: التحليل

source: Search
ar: البحث

source: Sources
ar: المصادر

source: Sides
ar: الجوانب

source: Email Words
ar: كلمات البريد الإلكتروني

source: Keywords
ar: الكلمات المفتاحية

source: Words
ar: الكلمات

source: Upload Files
ar: رفع الملفات

source: File Library
ar: مكتبة الملفات

source: Notifications
ar: الإشعارات

source: Settings
ar: الإعدادات

source: Language
ar: اللغة

source: Go Forward
ar: تقدم

source: Refresh Page
ar: تحديث الصفحة

source: Home
ar: الرئيسية

source: Word Details
ar: تفاصيل الكلمة

source: Are you sure you want to refresh? Unsaved changes may be lost.
ar: هل أنت متأكد أنك تريد التحديث؟ قد تُفقد التغييرات غير المحفوظة.

source: Success
ar: نجح

source: Error
ar: خطأ

source: Processing
ar: المعالجة

source: Close
ar: إغلاق

source: Unknown error
ar: خطأ غير معروف

source: Processing...
ar: جاري المعالجة...

source: Please select files to analyze
ar: يرجى اختيار الملفات للتحليل

source: Please select files to export
ar: يرجى اختيار الملفات للتصدير

source: Please select files to delete
ar: يرجى اختيار الملفات للحذف

source: No results to export
ar: لا توجد نتائج للتصدير

source: Content copied to clipboard!
ar: تم نسخ المحتوى إلى الحافظة!

source: Analysis started for
ar: تم بدء التحليل لـ

source: files
ar: ملفات

source: Error starting analysis
ar: خطأ في بدء التحليل

source: Deleted
ar: حذف

source: Error deleting files
ar: خطأ في حذف الملفات

source: Error deleting file
ar: خطأ في حذف الملف

source: File deleted
ar: حذف

source: Delete files? This cannot be undone.
ar: حذف الملفات؟ لا يمكن التراجع عن هذا.

source: Delete this file? This cannot be undone.
ar: حذف هذا الملف؟ لا يمكن التراجع عن هذا.

source: Error loading notifications
ar: خطأ في تحميل الإشعارات

source: Invalid navigation parameters
ar: معاملات التنقل غير صالحة

source: Error loading file details
ar: خطأ في تحميل تفاصيل الملف

source: Error saving changes
ar: خطأ في حفظ التغييرات

source: Cancel
ar: إلغاء

source: Add
ar: إضافة

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: Create
ar: إنشاء

source: Reset
ar: إعادة تعيين

source: Back
ar: رجوع

source: Next
ar: التالي

source: Previous
ar: السابق

source: Apply
ar: تطبيق

source: Clear
ar: مسح البحث

source: Refresh
ar: تحديث

source: Export
ar: تصدير

source: Download
ar: تحميل

source: Details
ar: التفاصيل

source: Copy
ar: نسخ

source: Select All
ar: تحديد الكل

source: Deselect All
ar: إلغاء تحديد الكل

source: Select None
ar: عدم تحديد أي شيء

source: No changes to save
ar: لا توجد تغييرات للحفظ

source: No data available
ar: لا توجد بيانات متاحة

source: No results found
ar: لم يتم العثور على نتائج

source: Loading...
ar: جاري التحميل...

source: Batch Analysis
ar: التحليل المجمع

source: Templates
ar: القوالب

source: History
ar: السجل

source: Path Analysis
ar: تحليل المسار

source: Avg Speed
ar: متوسط السرعة

source: Success Rate
ar: معدل النجاح

source: Est. Time
ar: الوقت المقدر

source: Queue Size
ar: حجم قائمة الانتظار

source: Pending Analysis
ar: تحليل معلق

source: High Priority
ar: أولوية عالية

source: Priority Level
ar: مستوى الأولوية

source: All Priorities
ar: جميع الأولويات

source: High
ar: عالي

source: Medium
ar: متوسط

source: Low
ar: منخفض

source: Schedule
ar: جدولة

source: Run Now
ar: تشغيل الآن

source: Off-Hours (11 PM)
ar: خارج ساعات العمل (11 مساءً)

source: Custom Time
ar: وقت مخصص

source: Error Handling
ar: معالجة الأخطاء

source: Retry Failed
ar: إعادة المحاولة للفاشلة

source: Skip Failed
ar: تخطي الفاشلة

source: Stop on Error
ar: إيقاف عند الخطأ

source: Resource Limit
ar: حد الموارد

source: Unlimited
ar: غير محدود

source: CPU
ar: المعالج

source: Source Filter
ar: تصفية المصدر

source: All Sources
ar: جميع المصادر

source: Side Filter
ar: تصفية الجانب

source: All Sides
ar: جميع الجوانب

source: File Type
ar: نوع الملف

source: All Types
ar: جميع الأنواع

source: Word
ar: كلمة

source: Text
ar: ترتيب حسب النص

source: Size Range
ar: نطاق الحجم

source: All Sizes
ar: جميع الأحجام

source: File Name
ar: اسم الملف

source: Type
ar: النوع

source: Size
ar: الحجم

source: Source
ar: المصدر

source: Priority
ar: الأولوية

source: files selected
ar: ملفات

source: Start Analysis
ar: بدء التحليل

source: Overall Progress
ar: التقدم الإجمالي

source: Completed
ar: مكتمل

source: Remaining
ar: متبقي

source: Errors
ar: أخطاء

source: Per-File Progress
ar: تقدم كل ملف

source: Current
ar: الحالي

source: Pause
ar: إيقاف مؤقت

source: Stop
ar: إيقاف

source: Batch Templates
ar: قوالب المجموعة

source: Quick Analysis
ar: تحليل سريع

source: Fast processing, standard settings
ar: معالجة سريعة، إعدادات قياسية

source: Deep Analysis
ar: تحليل عميق

source: Thorough processing, all features
ar: معالجة شاملة، جميع الميزات

source: Off-Hours
ar: خارج ساعات العمل

source: Scheduled for 11 PM
ar: مجدول لـ 11 مساءً

source: Save New Template
ar: حفظ قالب جديد

source: Create custom template
ar: إنشاء قالب مخصص

source: Batch Analysis History
ar: سجل التحليل المجمع

source: Batch
ar: مجموعة

source: Today at 2:30 PM
ar: اليوم الساعة 2:30 مساءً

source: success
ar: نجاح

source: avg
ar: متوسط

source: Yesterday at 11:00 PM
ar: أمس الساعة 11:00 مساءً

source: 2 days ago at 3:15 PM
ar: منذ يومين الساعة 3:15 مساءً

source: Resource Optimization
ar: تحسين الموارد

source: CPU Usage
ar: استخدام المعالج

source: Memory Usage
ar: استخدام الذاكرة

source: Disk I/O
ar: قراءة/كتابة القرص

source: Analysis paused
ar: تم إيقاف التحليل مؤقتاً

source: Stop analysis? Progress will be lost.
ar: إيقاف التحليل؟ سيتم فقدان التقدم.

source: Analysis Complete!
ar: اكتمل التحليل!

source: File
ar: ملف

source: Template applied
ar: تم تطبيق القالب

source: Overview
ar: نظرة عامة

source: Comprehensive Dashboard
ar: لوحة التحكم الشاملة

source: Files Analysis
ar: تحليل الملفات

source: Files filters
ar: تصفية الملفات

source: Category
ar: الفئة

source: Filter by category
ar: تصفية حسب الفئة

source: All Categories
ar: جميع الفئات

source: Filter by source
ar: تصفية حسب المصدر

source: Side
ar: الجوانب

source: Filter by side
ar: تصفية حسب الجانب

source: Keyword
ar: الكلمة المفتاحية

source: Filter by keyword
ar: تصفية حسب الكلمة المفتاحية

source: All Keywords
ar: جميع الكلمات المفتاحية

source: Apply filters
ar: تطبيق التصفية

source: Apply Filters
ar: تطبيق التصفية

source: Reset filters
ar: إعادة تعيين التصفية

source: File types distribution chart
ar: مخطط توزيع أنواع الملفات

source: Categories Analysis
ar: تحليل الفئات

source: Categories filters
ar: تصفية الفئات

source: Categories distribution chart
ar: مخطط توزيع الفئات

source: Keywords Analysis
ar: تحليل الكلمات المفتاحية

source: Keywords filters
ar: تصفية الكلمات المفتاحية

source: Keywords distribution chart
ar: مخطط توزيع الكلمات المفتاحية

source: Sources Analysis
ar: تحليل المصادر

source: Sources filters
ar: تصفية المصادر

source: Filter by file type
ar: تصفية حسب نوع الملف

source: All File Types
ar: جميع أنواع الملفات

source: Sources file count chart
ar: مخطط عدد ملفات المصادر

source: Sources size distribution chart
ar: مخطط توزيع حجم المصادر

source: Sources processing rate chart
ar: مخطط معدل معالجة المصادر

source: Sides Analysis
ar: تحليل الجوانب

source: Sides filters
ar: تصفية الجوانب

source: Sides statistics chart
ar: مخطط إحصائيات الجوانب

source: Words filters
ar: تصفية الكلمات

source: Category (Optional)
ar: الفئة (اختياري)

source: Load words
ar: تحميل الكلمات

source: Load Words
ar: تحميل الكلمات

source: Words distribution chart
ar: مخطط توزيع الكلمات

source: File Count
ar: عدد الملفات

source: Total Size
ar: الحجم الإجمالي

source: Avg Size
ar: متوسط الحجم

source: Word Count
ar: عدد الكلمات

source: File Density
ar: كثافة الملفات

source: Source Name
ar: اسم المصدر

source: File Types
ar: أنواع الملفات

source: Processed
ar: معالج

source: Processing Rate
ar: معدل المعالجة

source: Side Name
ar: اسم الجانب

source: Importance
ar: الأهمية

source: No file types found
ar: لم يتم العثور على أنواع ملفات

source: No categories found
ar: لم يتم العثور على فئات

source: No keywords found
ar: لم يتم العثور على كلمات مفتاحية

source: No sources found
ar: لم يتم العثور على مصادر

source: No sides found
ar: لم يتم العثور على جوانب

source: No words found
ar: لم يتم العثور على كلمات

source: Error loading data
ar: خطأ في تحميل البيانات

source: Unknown
ar: غير معروف

source: file types
ar: أنواع الملفات

source: categories
ar: الفئات

source: keywords
ar: الكلمات المفتاحية

source: sources
ar: المصادر

source: sides
ar: الجوانب

source: items
ar: عناصر

source: Files
ar: الملفات

source: Density
ar: الكثافة

source: Total Files
ar: إجمالي الملفات

source: Advanced filtering and analysis across files, categories, keywords, sources, and words
ar: تصفية وتحليل متقدم عبر الملفات والفئات والكلمات المفتاحية والمصادر والكلمات

source: Dashboard views
ar: عروض لوحة التحكم

source: Categories
ar: الفئات

source: Similar Files
ar: ملفات

source: File Types Table
ar: جدول أنواع الملفات

source: File Types Chart
ar: مخطط أنواع الملفات

source: Categories Table
ar: جدول الفئات

source: Categories Chart
ar: مخطط الفئات

source: Keywords Table
ar: جدول الكلمات المفتاحية

source: Keywords Chart
ar: مخطط الكلمات المفتاحية

source: Sources Table
ar: جدول المصادر

source: File Count Chart
ar: مخطط عدد الملفات

source: Size Distribution Chart
ar: مخطط توزيع الحجم

source: Processing Rate Chart
ar: مخطط معدل المعالجة

source: Sides Table
ar: جدول الجوانب

source: Sides Chart
ar: مخطط الجوانب

source: Words Layout
ar: تخطيط الكلمات

source: Words by Category
ar: الكلمات حسب الفئة

source: Toggle view mode
ar: تبديل وضع العرض

source: Chart View
ar: عرض المخطط

source: Similar Files Analysis
ar: تحليل الملفات المشابهة

source: Similar files filters
ar: تصفية الملفات المشابهة

source: Similarity Threshold
ar: عتبة التشابه

source: Filter by similarity threshold
ar: تصفية حسب عتبة التشابه

source: Very High (90%+)
ar: عالية جداً (90%+)

source: High (80%+)
ar: عالية (80%+)

source: Medium (70%+)
ar: متوسطة (70%+)

source: Low (60%+)
ar: منخفضة (60%+)

source: Min Group Size
ar: الحد الأدنى لحجم المجموعة

source: Minimum files per group
ar: الحد الأدنى للملفات لكل مجموعة

source: 2+ files
ar: 2+ ملفات

source: 3+ files
ar: 3+ ملفات

source: 5+ files
ar: 5+ ملفات

source: 10+ files
ar: 10+ ملفات

source: Group Type
ar: نوع المجموعة

source: Filter by group type
ar: تصفية حسب نوع المجموعة

source: Hash Duplicates
ar: التكرارات المتطابقة

source: Similar Titles
ar: العناوين المشابهة

source: Load Similar Files
ar: تحميل الملفات المشابهة

source: Similar Files Groups
ar: مجموعات الملفات المشابهة

source: No similar files found
ar: لم يتم العثور على ملفات مشابهة

source: groups
ar: مجموعات

source: Hash Duplicate
ar: تكرار متطابق

source: Similar Title
ar: عنوان مشابه

source: Grid View
ar: عرض الشبكة

source: Comprehensive File Analytics
ar: تحليلات الملفات الشاملة

source: Deep insights into your file collection with advanced visualizations and analysis
ar: رؤى عميقة في مجموعة ملفاتك مع تصورات وتحليلات متقدمة

source: Active Processing Tasks
ar: مهام المعالجة النشطة

source: Processed Files
ar: الملفات المعالجة

source: % processed
ar: % معالج

source: Different formats
ar: تنسيقات مختلفة

source: Total Words
ar: إجمالي الكلمات

source: Unique words extracted
ar: كلمات فريدة مستخرجة

source: Classification groups
ar: مجموعات التصنيف

source: Storage Used
ar: التخزين المستخدم

source: Total data size
ar: إجمالي حجم البيانات

source: File Reports
ar: تقارير الملفات

source: Search & Filter
ar: البحث والتصفية

source: Storage & Analytics
ar: التخزين والتحليلات

source: File Timeline
ar: الجدول الزمني للملفات

source: Week
ar: أسبوع

source: Month
ar: شهر

source: Year
ar: سنة

source: File Type Distribution
ar: توزيع نوع الملف

source: Processing Statistics
ar: إحصائيات المعالجة

source: Category Distribution
ar: توزيع الفئات

source: Word Frequency Analysis
ar: تحليل تكرار الكلمات

source: Top 25
ar: أفضل 25

source: Top 50
ar: أفضل 50

source: Top 100
ar: أفضل 100

source: Loading word frequency data...
ar: جاري تحميل بيانات تكرار الكلمات...

source: Path Level Analysis
ar: تحليل مستوى المسار

source: Loading path hierarchy...
ar: جاري تحميل هيكل المسار...

source: Detailed File Reports
ar: تقارير الملفات التفصيلية

source: Loading file reports...
ar: جاري تحميل تقارير الملفات...

source: Search files by keyword, category, or path...
ar: البحث عن الملفات بالكلمة المفتاحية أو الفئة أو المسار...

source: Search Results
ar: نتائج البحث

source: 0 results
ar: 0 نتائج

source: Enter search criteria
ar: أدخل معايير البحث

source: Use the search bar above to find specific files
ar: استخدم شريط البحث أعلاه للعثور على ملفات محددة

source: Storage Distribution
ar: توزيع التخزين

source: By Type
ar: حسب النوع

source: By Status
ar: حسب الحالة

source: By Size
ar: حسب الحجم

source: Storage Details
ar: تفاصيل التخزين

source: Storage Growth Over Time
ar: نمو التخزين مع الوقت

source: Processing Performance
ar: أداء المعالجة

source: Success Rate by File Type
ar: معدل النجاح حسب نوع الملف

source: Processing Speed (Last 30 Days)
ar: سرعة المعالجة (آخر 30 يوم)

source: Content Analysis
ar: تحليل المحتوى

source: Content Coverage
ar: تغطية المحتوى

source: Top Categories
ar: أفضل الفئات

source: Most Frequent Words
ar: الكلمات الأكثر تكراراً

source: Largest Files
ar: أكبر الملفات

source: Path
ar: المسار

source: Searching...
ar: جاري البحث...

source: No word data available
ar: لا توجد بيانات كلمات متاحة

source: No path data available
ar: لا توجد بيانات مسار متاحة

source: No files available
ar: لا توجد ملفات متاحة

source: Try different search criteria
ar: جرب معايير بحث مختلفة

source: Search error
ar: خطأ في البحث

source: this week
ar: هذا الأسبوع

source: results
ar: نتائج

source: processed
ar: معالج

source: Files analyzed
ar: الملفات المحللة

source: Total instances
ar: إجمالي الحالات

source: Files classified
ar: الملفات المصنفة

source: Success Rate (%)
ar: معدل النجاح (%)

source: Files Processed
ar: الملفات المعالجة

source: Storage (MB)
ar: التخزين (ميجابايت)

source: Files Added
ar: الملفات المضافة

source: Storage Added (MB)
ar: التخزين المضاف (ميجابايت)

source: Number of Files
ar: عدد الملفات

source: Files per Category
ar: الملفات لكل فئة

source: Category Distribution (Pie Chart)
ar: توزيع الفئات (مخطط دائري)

source: With Content
ar: مع محتوى

source: With Words
ar: مع كلمات

source: No Content
ar: بدون محتوى

source: Status
ar: الحالة

source: File Classification Analysis
ar: تحليل تصنيف الملفات

source: Analyzed Files
ar: الملفات المحللة

source: Folder Analysis
ar: تحليل المجلد

source: Database Analysis
ar: تحليل قاعدة البيانات

source: Analyze and classify all files in a specific folder
ar: تحليل وتصنيف جميع الملفات في مجلد محدد

source: Folder Path:
ar: مسار المجلد:

source: Enter full folder path (e.g., C:\Users\Documents or /home/user/documents)
ar: أدخل مسار المجلد الكامل (مثل: C:\Users\Documents أو /home/user/documents)

source: Enter the complete path to the folder you want to analyze
ar: أدخل المسار الكامل للمجلد الذي تريد تحليله

source: Classification Method:
ar: طريقة التصنيف:

source: Rule-Based
ar: قائم على القواعد

source: Machine Learning
ar: التعلم الآلي

source: Deep Learning
ar: التعلم العميق

source: Ensemble
ar: التجميع

source: Analyze Folder
ar: تحليل مجلد

source: Analyze and classify a single file by content and title
ar: تحليل وتصنيف ملف واحد حسب المحتوى والعنوان

source: File ID:
ar: معرف الملف:

source: Enter file ID
ar: أدخل معرف الملف

source: Analyze File
ar: تحليل ملف

source: Analyze and classify files across the entire database
ar: تحليل وتصنيف الملفات عبر قاعدة البيانات بأكملها

source: Limit:
ar: الحد:

source: Maximum number of files to analyze (1-10000)
ar: الحد الأقصى لعدد الملفات للتحليل (1-10000)

source: Analyze Database
ar: تحليل قاعدة البيانات

source: Explore files organized by directory structure with detailed metrics and analytics
ar: استكشف الملفات المنظمة حسب هيكل المجلد مع مقاييس وتحليلات مفصلة

source: Directory Structure
ar: أضف ملفات لرؤية هيكل المجلد

source: Expand All
ar: الكل

source: Expand
ar: توسيع

source: Collapse All
ar: الكل

source: Collapse
ar: طي

source: Filters
ar: تصفية

source: active
ar: نشط

source: Clear Filters
ar: تصفية

source: Loading paths...
ar: جاري تحميل المسارات...

source: Select a path
ar: المسار

source: Folder Analytics
ar: تحليلات المجلد

source: Processing Status
ar: المعالجة

source: Classification Distribution
ar: توزيع التصنيف

source: Categorized
ar: غير مصنف

source: Uncategorized
ar: غير مصنف

source: Category Words Breakdown
ar: تفصيل كلمات الفئة

source: Total Categories
ar: الفئات

source: Files Analyzed
ar: ملفات

source: Top Keywords (Bar Chart)
ar: أفضل الكلمات المفتاحية (مخطط شريطي)

source: Word Cloud
ar: كلمة

source: Loading keywords...
ar: جاري تحميل الكلمات المفتاحية...

source: File Creation Timeline (Last 30 Days)
ar: الجدول الزمني لإنشاء الملفات (آخر 30 يوم)

source: Files in This Folder
ar: الملفات في هذا المجلد

source: Scroll horizontally for more
ar: انتقل أفقياً للمزيد

source: Loading files...
ar: جاري تحميل الملفات...

source: Select a Directory to Begin
ar: اختر مجلداً للبدء

source: Click on any folder name in the directory tree on the left to view:
ar: انقر على أي اسم مجلد في شجرة المجلدات على اليسار لعرض:

source: File statistics and metrics
ar: إحصائيات ومقاييس الملفات

source: File type distribution charts
ar: توزيع نوع الملف

source: Top keywords from folder contents
ar: أفضل الكلمات المفتاحية من محتويات المجلد

source: File creation timeline
ar: الجدول الزمني لإنشاء الملفات

source: All files in the folder
ar: جميع الملفات في المجلد

source: Tip:
ar: نصيحة:

source: Click the
ar: انقر على

source: button to expand folders and see subfolders
ar: زر لتوسيع المجلدات ورؤية المجلدات الفرعية

source: Category Files
ar: ملفات

source: Category Words
ar: الفئة

source: Loading words...
ar: جاري تحميل الكلمات...

source: No paths found
ar: لم يتم العثور على مسارات

source: Add files to see directory structure
ar: أضف ملفات لرؤية هيكل المجلد

source: Error loading paths
ar: خطأ في تحميل المسارات

source: Please try refreshing the page
ar: يرجى محاولة تحديث الصفحة

source: No file type data available
ar: لا توجد بيانات نوع ملف متاحة

source: No status data available
ar: لا توجد بيانات حالة متاحة

source: No timeline data available for the last 30 days
ar: لا توجد بيانات جدول زمني متاحة لآخر 30 يوم

source: Error loading chart data
ar: خطأ في تحميل بيانات المخطط

source: Files Created
ar: الملفات المنشأة

source: Appears in {count} files
ar: يظهر في {count} ملفات

source: This folder contains no extractable keywords
ar: هذا المجلد لا يحتوي على كلمات مفتاحية قابلة للاستخراج

source: Error loading keywords
ar: خطأ في تحميل الكلمات المفتاحية

source: No word frequency data available
ar: لا توجد بيانات تكرار كلمات متاحة

source: No files in this path
ar: لا توجد ملفات في هذا المسار

source: This folder appears to be empty or the path pattern doesn't match any files
ar: يبدو أن هذا المجلد فارغ أو نمط المسار لا يطابق أي ملفات

source: Error loading files
ar: خطأ في تحميل الملفات

source: No classification data available
ar: لا توجد بيانات تصنيف متاحة

source: Error loading classification data
ar: خطأ في تحميل بيانات التصنيف

source: Percentage
ar: النسبة المئوية

source: No category data available for this folder
ar: لا توجد بيانات فئة متاحة لهذا المجلد

source: Error loading category analysis
ar: خطأ في تحميل تحليل الفئة

source: No Words Found
ar: الكلمات

source: No words found in the "{category}" category.
ar: لم يتم العثور على كلمات

source: Error Loading Words
ar: خطأ في تحميل الكلمات

source: Click any word to see files
ar: انقر على أي كلمة لرؤية الملفات

source: word{s} in this category
ar: كلمة في هذه الفئة

source: Found in {count} file{s}
ar: موجود في {count} ملف

source: Files in "{category}" Category
ar: ملفات

source: Words in "{category}" Category
ar: الكلمات

source: Files containing "{word}"
ar: الملفات التي تحتوي على \

source: Loading files for {category}...
ar: جاري تحميل الملفات لـ {category}...

source: Loading words for {category}...
ar: جاري تحميل الكلمات لـ {category}...

source: Loading files containing "{word}"...
ar: جاري تحميل الملفات التي تحتوي على \

source: No Files Found
ar: ملفات

source: No files found in the "{category}" category for this folder.
ar: لم يتم العثور على ملفات في \

source: Error Loading Files
ar: خطأ في تحميل الملفات

source: file{s} found
ar: ملف

source: file{s} contain "{word}"
ar: ملف يحتوي على \

source: Sorted by word frequency
ar: مرتب حسب تكرار الكلمة

source: Appears {count} time{s} in file
ar: يظهر {count} مرة في الملف

source: Words in file
ar: ملف

source: No words found in this file
ar: لم يتم العثور على كلمات في هذا الملف

source: No specific keywords found
ar: لم يتم العثور على كلمات مفتاحية محددة

source: These files have no assigned keywords
ar: هذه الملفات لا تحتوي على كلمات مفتاحية معينة

source: Classification based on keywords below
ar: التصنيف بناءً على الكلمات المفتاحية أدناه

source: Category Name
ar: الفئة

source: Distribution
ar: توزيع نوع الملف

source: Detailed Classification Breakdown
ar: تفصيل التصنيف التفصيلي

source: (Click on any row to see files)
ar: (انقر على أي صف لرؤية الملفات)

source: (Click on any row to see words, then click word to see files)
ar: (انقر على أي صف لرؤية الكلمات، ثم انقر على الكلمة لرؤية الملفات)

source: Read
ar: تعليم الكل كمقروء

source: Unread
ar: غير مقروء

source: N/A
ar: غير متاح

source: Import/Export
ar: استيراد/تصدير

source: Batch file import, database backup, and settings management
ar: استيراد ملفات مجمع ونسخ احتياطي لقاعدة البيانات وإدارة الإعدادات

source: Batch File Import
ar: استيراد ملفات مجمع

source: Import Method
ar: طريقة الاستيراد

source: File Paths List
ar: قائمة مسارات الملفات

source: CSV File
ar: ملف CSV

source: File Paths (one per line)
ar: مسارات الملفات (واحد في كل سطر)

source: CSV should have a file_path column
ar: يجب أن يحتوي ملف CSV على عمود file_path

source: Source ID
ar: معرف المصدر

source: Side ID
ar: معرف الجانب

source: Import Files
ar: استيراد ملفات

source: Database Backup
ar: نسخ احتياطي لقاعدة البيانات

source: Export Backup
ar: تصدير النسخة الاحتياطية

source: Import Backup
ar: استيراد النسخة الاحتياطية

source: Include data in backup
ar: تضمين البيانات في النسخة الاحتياطية

source: Export Settings
ar: تصدير الإعدادات

source: Import Settings
ar: استيراد الإعدادات

source: Please enter Source ID and Side ID
ar: يرجى إدخال معرف المصدر ومعرف الجانب

source: Please enter at least one file path
ar: يرجى إدخال مسار ملف واحد على الأقل

source: Please select a CSV file
ar: يرجى اختيار ملف CSV

source: Import Complete
ar: اكتمل الاستيراد

source: Total
ar: الإجمالي

source: Successful
ar: نجح

source: Failed
ar: فشل

source: Import failed
ar: فشل الاستيراد

source: Error exporting backup
ar: خطأ في تصدير النسخة الاحتياطية

source: Backup Valid
ar: النسخة الاحتياطية صالحة

source: Tables
ar: الجداول

source: Invalid backup
ar: نسخة احتياطية غير صالحة

source: Error exporting settings
ar: خطأ في تصدير الإعدادات
